/* package houmework01.lesson07;
import java.util.Scanner;

import static java.lang.System.in;
import static java.lang.System.out;

public class Homework08a {

    static public void main(String[] args) {
        Scanner scanner = new Scanner(in);
        String s1 = scanner.next();
        String s2 = scanner.next();

        if (s1.length() > s2.length()) {
            System.out.println("Строка\"" + s1 + "\" длиннее!");
        } else if (s1.length() < s2.length()){
            System.out.println("Строка\"" + s2 + "\" длиннее!");
        }   else{
            System.out.println("Строки равны по длине!");
        }
    }
}

package houmework01.lesson07;
import java.util.Scanner;
/*
Задание 1:
Напишите программу, которая запросит ввести ваш возраст,
и напишет, кем вы являетесь: ребенком, подростком,
взрослым либо стариком.

public class Homework07a {*/