package houmework01;

public class Homework05 {

    public static void main(String[] args) {
        /*
        1. Задание на операторы сравнения:
    Напишите программу, которая сравнивает два введенных числа a и b. Программа должна выводить:

    "a больше b", если a > b
    "a меньше b", если a < b
    "a равно b", если a и b равны  */

    int a = 400;
    int b = 300;

    if(a>b) {
        System.out.println("a больше b");
        }
    else
    if(a<b){
        System.out.println("a меньше b");
    }
    else { //я не поставила скобки, поэтому не получила плюсик за ДЗ
        System.out.println("a равно b");
    }
    }
}
