package first.app;

// public --> модификатор доступа, класс общедоступный
public class MyApp {

    // void--> метод ничего не возвращает=пустота (англ.)
    // main --> название метода
    // String[] args--> параметры (аргументы) метода
    //{...}-->тело метода
    // вся строка называется - сигнатура метода

    /*
    тут можно писать сколько угодно строк текста
    но обязательно комментарий должен быть закрыт
     */
    public static void main(String[] args) {
        //Тело метода
        System.out.print ("Hello and good bye!");


    }
}
